# Handling Missing Value

In [10]:
import pandas as pd
from numpy import nan as NA
data=pd.DataFrame([[1,6.5,3],[1, NA, NA],
                   [NA,NA,NA],[NA,6.5,3]],
                 columns=list("abc"))
display(data)
print("======================")
#Dropna function delete all the row which have the null value
cleaned=data.dropna()
display(cleaned)
#how="all" remove only that which data is All Null
cleaned=data.dropna(how="all")
display(cleaned)
print("Data Delete Through Columns")
cleaned=data.dropna(axis=1, how="all")
display(cleaned)

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

======================

     a    b    c
0  1.0  6.5  3.0

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

Data Delete Through Columns

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

# Filling Missing Data

In [19]:
import numpy as np
df=pd.DataFrame(np.random.rand(7,3))
display(df)
df.iloc[:4, 1]=NA
df.iloc[:2, 2]=NA
display(df)
x=df.fillna(2.5)
display(x)
df=df.fillna({1:0.5,2:0})
display(df)

          0         1         2
0  0.385750  0.230852  0.457642
1  0.100601  0.711232  0.603426
2  0.097183  0.337582  0.442352
3  0.861652  0.366490  0.179706
4  0.103703  0.265019  0.584095
5  0.651803  0.651592  0.012310
6  0.279052  0.070026  0.799888

          0         1         2
0  0.385750       NaN       NaN
1  0.100601       NaN       NaN
2  0.097183       NaN  0.442352
3  0.861652       NaN  0.179706
4  0.103703  0.265019  0.584095
5  0.651803  0.651592  0.012310
6  0.279052  0.070026  0.799888

          0         1         2
0  0.385750  2.500000  2.500000
1  0.100601  2.500000  2.500000
2  0.097183  2.500000  0.442352
3  0.861652  2.500000  0.179706
4  0.103703  0.265019  0.584095
5  0.651803  0.651592  0.012310
6  0.279052  0.070026  0.799888

          0         1         2
0  0.385750  0.500000  0.000000
1  0.100601  0.500000  0.000000
2  0.097183  0.500000  0.442352
3  0.861652  0.500000  0.179706
4  0.103703  0.265019  0.584095
5  0.651803  0.651592  0.012310
6  0.279052  0.070026  0.799888

# Removing Dublicates

In [32]:
data=pd.DataFrame({"K1":['one','two']*3+['two'],
                  "K2":[1,1,2,3,3,4,4]})
display(data)
print(data.duplicated())
data=data.drop_duplicates()
display(data)
data["V1"]=['one','two','one','three','one','four']
display(data)
print()
data=data.drop_duplicates(["K1","V1"])
display(data)

    K1  K2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

    K1  K2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

    K1  K2     V1
0  one   1    one
1  two   1    two
2  one   2    one
3  two   3  three
4  one   3    one
5  two   4   four

    K1  K2     V1
0  one   1    one
1  two   1    two
3  two   3  three
5  two   4   four